function f1() {
    document.getElementById("slika2").src =
        "https://www.w3schools.com/images/w3schools_green.jpg"
    document.getElementById("slika2").width = "200"
    document.getElementById("slika2").height = "200"
}
function f2() {
    {
        document.getElementById("prikaz").src = "slike/picasso1.jpg"
        document.getElementById("p1").textContent = "Пикасови аутопортрети су важни јер обухватају читаву његову каријери можемо пратити како се његов начин самоприказања мењао током времена у Пикасов плави период (1901–1904), који карактеришу мрачне слике приказане у нијансама плаве и плаво-зелене само повремено загрејане другим бојама, почело је или у Шпанији почетком 1901. или у Паризу у другој половини године."
        setTimeout(f3, 3000)
        
    }
}
function f3() {

    document.getElementById("prikaz").src = "slike/picasso2.jpg"
    document.getElementById("p1").textContent = "Чини се да је кроз овај портрет Пикасо покушавао да изрази своја осећања према обема женама. Ова двојност је видљива у транзицији два стила — мекши, празничнији осећај „периода, Марие-Терез“ уступа место болнијим кубистичким облицима повезаним са политички настројеном Дором Мар (1937. исте године када је позирала за „Веепинг жена»која је сада део колекције Тејт Модерн у Лондону)."
    setTimeout(f4, 3000)
}
function f4() {
    document.getElementById("prikaz").src = "slike/picasso3.jpg"
    document.getElementById("p1").textContent = "Пикасо и привлачност југа“ ће истраживати креативне периоде шпанског уметника Пабла Пикаса током његових путовања иу његовим атељеима по јужној Европи, у планинским градовима северне Шпаније и дуж медитеранске обале Француске. Отвара се 29. јануара 2022. и остаје на располагању до 22. маја 2022."
    setTimeout(f5, 3000)
}
function f5() {

    document.getElementById("prikaz").src = "slike/picasso4.png"
    document.getElementById("p1").textContent = "Пикасови портрети његове златне музе Мари-Терезе неоспорно су обележје уметности 20. века рекла је Брук Лемпли, председница и шефица глобалне продаје лепих уметности у Сотбију, који продаје слику. Фемме нуе цоуцхее је била „дубоко лирска ода уметниковој неограниченој жељи за Маријом Терезом са својим бескрајно савитљивим удовима налик на пераје, портрет наставља да очарава јер савршено приказује Пикасову музу као крајњи израз његовог генија."
    setTimeout(f6, 3000)
}
function f6() {
    document.getElementById("prikaz").src = "slike/picasso5.jpg"
    document.getElementById("p1").textContent = "Герника (шпански: [ɡеɾˈника]; баскијски: [ɡерника]) је велика слика уља на платну из 1937. шпанског уметника Пабла Пикаса. То је једно од његових најпознатијих дела, које многи уметнички критичари сматрају најдирљивијим и најмоћнијим антиратним сликарством у историји. Изложена је у Мусео Реина Софиа у Мадриду. Сива, црно-бела слика, која је висока 3,49 метара (11 стопа 5 инча) и 7,76 метара (25 стопа 6 инча) у пречнику, приказује патњу изазвану насиљем и хаосом. Истакнути у композицији су избодени коњ, бик, вриштеће жене, мртва беба, раскомадани војник и пламен."
    setTimeout(f7, 3000)
}
function f7() {
    document.getElementById("prikaz").src = "slike/picasso6.jpg"
    document.getElementById("p1").textContent = "Плави период (шпански: Периодо Азул) је термин који се користи за дефинисање дела шпанског сликара Пабла Пикаса између 1901. и 1904. када је сликао у суштини монохроматске слике у нијансама плаве и плаво-зелене, само повремено загрејане другим бојама. Ова мрачна дела, инспирисана Шпанијом и насликана у Барселони и Паризу, сада су нека од његових најпопуларнијих дела, иако је у то време имао потешкоћа да их прода."
    setTimeout(f2, 3000)
}
